<template>
  <div id="termsof">
    <h2>利用規約</h2>
    <hr>
    <p>この利用規約（以下、「本規約」といいます。）は、ついふぁい（以下、本サービス」といいます。）の利用条件を定めるものです。<br>
      ユーザーの皆さま（以下、「ユーザー」といいます。）には、本規約に従って、本サービスをご利用いただきます。
    </p>

    <h3>1.規約の適用</h3>
    <p>本規約は、ユーザーと本サービスの利用に関わる一切の関係に適用されるものとします。</p>

    <h3>2.規約の変更</h3>
    <p>運営者はユーザーの了解を得ることなく本規約を変更することがあります。<br>
      この場合、本サービスの利用条件は、変更後の本規約によるものとします。<br>
      変更後の規約は、運営者が別途定める場合を除き、本サイト上に表示した時点より、効力を生じるものとします。
    </p>

    <h3>3.利用者登録</h3>
    <p>Twitterログインにより、ログインが完了した時点で利用者となり、
      本規約の条件による本サービスの利用の許可が運営者より利用者に有効に付与されるものとします。
    </p>

    <h3>4.禁止行為</h3>
    <p>運営者は、ユーザーが次の各号のいずれかに該当すると判断した場合、
      ユーザーへの事前の通知若しくは催告を要することなく、
      利用禁止処分または本利用規約の全部若しくは一部を解約することができるものとします。<br>

      本サービスの運営を妨害する行為。 虚偽の情報を登録・記入・送信する行為。<br>
      過去に本利用規約違反等の理由によりユーザー資格の取り消しを受けていたにも関わらず、ユーザー登録の申込をする行為。<br>
      コンピュータ・ウィルス等の有害なコンピュータプログラム等を送信または頒布する行為、
      チェーンメール・スパムメール等の送信を目的とする行為、並びに本サービスに著しく負荷のかかる行為。<br>
      本サービスにより利用しうる情報を改ざんまたは消去する行為。<br>
      運営者または第三者の財産、プライバシー、名誉または肖像権を侵害する行為、または侵害するおそれのある行為、ストーカー的行為。<br>
      運営者または第三者を差別・誹謗中傷し、その名誉または信用を毀損する行為、並びに人種的・民族的・宗教的に不快感を与える行為。<br>
      わいせつな映像・画像等の配信またはそれらを掲載する他のウェブサイトへの誘導をする行為。<br>
      その他、公序良俗に違反し、または他者の権利を侵害すると運営者が判断した行為。<br>
      その他運営者が不適切であると判断する行為。
    </p>

    <h3>5.サービスの一時的な中断</h3>
    <p>運営者は、次の各号いずれかの事由に該当する場合、ユーザーに事前に通知することなく、一時的に本サービスの運営を中断することがあります。
    <br>
    本サービスまたは関連設備の保守を定期的または緊急に行うとき。<br>
    本サービスで利用する通信回線、電力等の提供が中断されたとき。<br>
    火災、停電、地震、台風、洪水、津波等の天災や疫病の発生等、運営者が支配できない事情（運営者が利用しているサーバーで生じた事情を含みます。）により本サービスの運営ができないとき。<br>
    その他運営者が必要と判断したとき。<br>
    運営者は、理由を問わず、本サービスの運営の遅滞、中断または停止に起因して、ユーザー、顧客または第三者が被った損害について、一切責任を負わないものとします。<br>

    <h3>6.免責事項</h3>
    <p>本サービスは、ユーザーに事前に通知することなく、一時的に本サービスの運営を中断することがあります。<br>

      本サービスの利用において、ユーザーの責により運営者その他の第三者に損害が発生した場合または権利が侵害された場合においてこれを解決するものとし、
      本サービス及び当該第三者に損害を賠償することとします。<br>
      天災地変、戦争・暴動・内乱、法令の制定・改廃、公権力による命令・処分、ストライキ等の争議行為、輸送機関の事故、
      その他当事者の責に帰し得ない事由による本利用規約に基づく債務の履行の遅滞または不能が生じた場合は、
      当該当事者はその責を負わないものとします。<br>
      運営者は、ユーザーに対し、以下の各号に該当する損害、ならびに以下の各号に付随する２次的なデータの漏洩、
      損失、損害にかかる損害について責任を負わないものとします。<br>
      運営者が提供していないプログラムによって生じる損害。<br>
      運営者以外の第三者による不正な行為によって生じる損害。<br>
      ハッカー及びクラッカーによるサーバーへの侵入または攻撃等の行為による損害。<br>
      運営者が本サービスのために用いるサーバーにおいて生じた事情により生じる損害。<br>
      本サービスのバグによって生じる損害。<br>
      運営者は、本サービスについて、その完全性、特定目的適合性、その他一切保証しないものとします。<br>
      運営者は、本サービスや本サイトの提供が中断することなく継続することを保証しません。<br>
      本サービスは、本サービスや本サイトの提供が停止または中止した場合も、ユーザーや第三者に生じた損害について責任を負いません。<br>
      運営者は、本サービスにユーザーがアップロードするデータ・情報に関しては、一切責任を負わないものとします。<br>
      本サービスにアップロードするデータ・情報の正確性や当該情報をアップデートする責任は、全てユーザーにあります。<br>
      運営者は、本サイトでの広告の表示・掲載を、第三者について行う場合があります。<br>
      ユーザーが、本サイトでの広告を通じて第三者から商品・サービスを購入する等、第三者と何らかの契約をされる場合、
      当該契約の当事者はユーザーと第三者であり、本サービスはいかなる責任も負いません。<br>
      ユーザーは、本サービスにおいて保存するデータについて、自らバックアップを行う義務を負います。<br>
      運営者は、本サービスにおいて、運営者の管理下にあるインターネットサーバーに保管・蓄積されるユーザーのデータについて
      バックアップを行いますが、本サービスによるバックアップにも関わらず、本サービスに保管・蓄積されたユーザーのデータが消失、
      毀損した場合には、本サービスは、ユーザーや第三者に対していかなる責任も負いません。<br>
    </p>

    <h3>7.本サービスの終了</h3>
    <p>運営者は、次の各号いずれかの事由に該当する場合、ユーザーに事前に通知することなく、
      一時的に本サービスの運営を中断することがあります。<br>

      運営者は、相当の周知期間をもってユーザーに通知の上、利用者に対する本サービス及び本サービスの一部を終了することができるものとします。<br>
      前項の通知は、本サイト上での掲示及び利用者への電子メールやWebサイト上への掲載によるものとします。<br>
      運営者はユーザーに対する通知後、本サービスを終了した場合には、
      利用者に対して本サービスは終了に伴い生じる損害、損失、その他の費用の賠償または補償を免れるものとします。<br>
    </p>

    <h3>8.合意管轄等</h3>
    <p>本規約の解釈にあたっては、日本法を準拠法とします。
      本サービスに関して紛争が生じた場合には、本サービスの本店所在地を管轄する裁判所を専属的合意管轄とします。
    </p>

    <h3>9.附則</h3>
    <p>2020年9月26日 制定・施行</p>

    <div class="back">
      <router-link
        to=router.go(-1)
      >戻る
      </router-link>
    </div>
  </div>
</template>

<style lang="sass" scoped>
  #termsof
    max-width: 400px
    height: 100%
    padding: 10px
    margin: auto
    padding-top: 52px
    p
      font-size: 12px
    ol
      list-style-type: decimal
      padding-left: 30px
      font-size: 12px
  h2
    text-align: center
  h3
    font-size: 16px
  .container
    padding: 10px
  .back
    text-align: center
    a
      display: inline-block
      margin: auto
      padding: 20px
      color: #FFF
</style>